
Процедура ПередЗаписью(Отказ)
	Движения.Остатки.Записывать = Истина;
	Движения.ОстаткиТоваровПоПартиям.Записывать =  Истина;   
	
	Для Каждого ЗаписьРегистра Из Движения.Остатки Цикл
		ЗаписьРегистра.ВидДвижения = ВидДвиженияНакопления.Приход;
		ЗаписьРегистра.ДокументОснования = "Ввод начальных остатков";
		
		ДвижениеОстатковТоваровПоПартиям = Движения.ОстаткиТоваровПоПартиям.Добавить(); 
		ДвижениеОстатковТоваровПоПартиям.ВидДвижения = ВидДвиженияНакопления.Приход; 
		ДвижениеОстатковТоваровПоПартиям.Период = ЗаписьРегистра.Период;
		ДвижениеОстатковТоваровПоПартиям.Товар = ЗаписьРегистра.Товар;
		ДвижениеОстатковТоваровПоПартиям.ОстатокТоваровВПартии = ЗаписьРегистра.Количество;
		ДвижениеОстатковТоваровПоПартиям.ОбщаяСтоимостьОстаткаПартии = ЗаписьРегистра.Сумма;
		                                          
	КонецЦикла;
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
