&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	Если  СтрокаТабличнойЧасти.Цена <> 0 Тогда
		Если СтрокаТабличнойЧасти.Цена <> Неопределено Тогда
			РаботаСДокументами.РассчитатьСумму(СтрокаТабличнойЧасти);   
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	РаботаСДокументами.РассчитатьСумму(СтрокаТабличнойЧасти);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)    
	
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;   
	
	Если СтрокаТабличнойЧасти = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.Товар) Тогда 
		Если  РаботаСоСправочниками.ЗакупочнаяЦена(Объект.Дата, СтрокаТабличнойЧасти.Товар) <> Неопределено Тогда 
			// Установить цену.
			СтрокаТабличнойЧасти.Цена = РаботаСоСправочниками.ОтпускнаяЦена(Объект.Дата, СтрокаТабличнойЧасти.Товар);
		КонецЕсли;
	Иначе
		СтрокаТабличнойЧасти.Цена = 0;
	КонецЕсли;
	// Пересчитать сумму строки
	РаботаСДокументами.РассчитатьСумму(СтрокаТабличнойЧасти);
КонецПроцедуры
