	
	Функция ЗаписатьОстаткиВXMLФайл () Экспорт
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|  ОстаткиОстатки.КоличествоОстаток КАК Остаток,
		|  ПРЕДСТАВЛЕНИЕ(ОстаткиОстатки.Товар) КАК Товар
		|ИЗ
		|  РегистрНакопления.Остатки.Остатки(&Дата) КАК ОстаткиОстатки";
		Запрос.УстановитьПараметр("Дата",ТекущаяДата());
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаРезультатаЗапроса = РезультатЗапроса.Выбрать();  
		
		Дата = Формат(ТекущаяДата(), "ДФ=дд.ММ.гг_ЧЧ.мм.сс");
		ПутьКФайлу = "C:\1C\MyBases\ВыгрузкаОтчетов\Остатки"+Дата+".xml";
		ЗаписьXML = Новый ЗаписьXML;
		ЗаписьXML.ОткрытьФайл(ПутьКФайлу, "UTF-8");
		ЗаписьXML.ЗаписатьОбъявлениеXML(); 
		ЗаписьXML.ЗаписатьНачалоЭлемента("Товары");
		
		
		Пока ВыборкаРезультатаЗапроса.Следующий() Цикл 
			Количество = Строка(ВыборкаРезультатаЗапроса.Остаток);
			Товар = ВыборкаРезультатаЗапроса.Товар;  
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("Товар"); 
			ЗаписьXML.ЗаписатьАтрибут("Товар", Товар);
			ЗаписьXML.ЗаписатьАтрибут("Количество", Количество);
			ЗаписьXML.ЗаписатьКонецЭлемента(); 			
		КонецЦикла; 
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ЗаписьXML.Закрыть();

		
	КонецФункции 