
&НаКлиенте
Процедура ТестJSON(Команда)
	ТестЖСОННаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ТестЖСОННаСервере()
	СтрокаJSON = JSONОбъекты.ПолучитьВсеТоварыJSON();
	Сообщить(СтрокаJSON);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ТестЗагрузкиКурсовНаСервере()
	ЗагрузкаКурсовВалют.HttpsЗапросКурсов();
КонецПроцедуры

&НаКлиенте
Процедура ТестЗагрузкиКурсов(Команда)
	ТестЗагрузкиКурсовНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ТестВыгрузкиОстатковВXMLНаСервере()
	ЗаписатьДанныеВXMLФайл.ЗаписатьОстаткиВXMLФайл();
КонецПроцедуры

&НаКлиенте
Процедура ТестВыгрузкиОстатковВXML(Команда)
	ТестВыгрузкиОстатковВXMLНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбновитьСпраочникВалютНаСервере()
	ЗагрузкаКурсовВалют.ОбновитьСправочникВалют();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСпраочникВалют(Команда)
	ОбновитьСпраочникВалютНаСервере();
КонецПроцедуры
