Процедура HttpsЗапросКурсов() Экспорт
	
	SSL =  Новый ЗащищенноеСоединениеOpenSSL();
	Соединение = Новый HTTPСоединение(
	"developerhub.alfabank.by", 
	8273, , , , , SSL);
	
	Запрос = Новый HTTPЗапрос("/partner/1.0.1/public/rates");
	
	Результат = Соединение.Получить(Запрос);
	СтрокаJSON = Результат.ПолучитьТелоКакСтроку();
	ДлинаСтроки = СтрДлина(СтрокаJSON);
	СтрокаJSONОбработанная = Сред(СтрокаJSON,10,ДлинаСтроки-10);
	
	ЧтениеJSON = Новый ЧтениеJSON();
	ЧтениеJSON.УстановитьСтроку(СтрокаJSONОбработанная);
	КурсыМассив = ПрочитатьJSON(ЧтениеJSON); 
	Для Каждого СтрокаМассива Из КурсыМассив Цикл
		СоздатьЗаписьВРегистреКурсыВалют(СтрокаМассива);
	КонецЦикла;
	

КонецПроцедуры 

&НаСервере
Процедура СоздатьЗаписьВРегистреКурсыВалют(СтруктураСДанными) Экспорт 
	Попытка
		КодВалюты1 = СтруктураСДанными.sellIso; 
		КодВалюты2 = СтруктураСДанными.buyIso;
		Если КодВалюты1 = "EUR" Тогда
			Если КодВалюты2 = "RUB" Тогда
				НоваяЗапись = РегистрыСведений.КурсыВалютКРублю.СоздатьМенеджерЗаписи();
				НоваяЗапись.Валюта = Справочники.Валюты.НайтиПоНаименованию("EUR");
				НоваяЗапись.КурсПокупки = СтруктураСДанными.buyRate;
				НоваяЗапись.КурсПродажи = СтруктураСДанными.sellRate; 
				НоваяЗапись.Период = ТекущаяДата(); 
				НоваяЗапись.Записать();
			КонецЕсли;
		КонецЕсли; 
		Если КодВалюты1 = "USD" Тогда
			Если КодВалюты2 = "RUB" Тогда
				НоваяЗапись = РегистрыСведений.КурсыВалютКРублю.СоздатьМенеджерЗаписи();
				НоваяЗапись.Валюта = Справочники.Валюты.НайтиПоНаименованию("USD");
				НоваяЗапись.КурсПокупки = СтруктураСДанными.buyRate;
				НоваяЗапись.КурсПродажи = СтруктураСДанными.sellRate;
				НоваяЗапись.Период = ТекущаяДата(); 
                НоваяЗапись.Записать();
			КонецЕсли;
		КонецЕсли; 
		Если КодВалюты1 = "RUB" Тогда
			Если КодВалюты2 = "BYN" Тогда
				НоваяЗапись = РегистрыСведений.КурсыВалютКРублю.СоздатьМенеджерЗаписи();
				НоваяЗапись.Валюта = Справочники.Валюты.НайтиПоНаименованию("BYN");
				НоваяЗапись.КурсПокупки = Окр(100 / СтруктураСДанными.sellRate, 2);
				НоваяЗапись.КурсПродажи = Окр (100 / СтруктураСДанными.buyRate, 2);
				НоваяЗапись.Период = ТекущаяДата(); 
                НоваяЗапись.Записать();
			КонецЕсли;
		КонецЕсли;
	Исключение
	КонецПопытки;
КонецПроцедуры

Процедура ОбновитьСправочникВалют() Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|   Справочник.Ссылка КАК СсылкаСправочника,
	|   Регистр.Валюта КАК СсылкаРегистра,
	|   Регистр.КурсПокупки КАК КурсПокупкиРегистра,
	|   Регистр.КурсПродажи КАК КурсПродажиРегистра,
	|   Регистр.Период КАК ДатаРегистра
	|ИЗ
	|   Справочник.Валюты как Справочник
	|   ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|   РегистрСведений.КурсыВалютКРублю.СрезПоследних КАК Регистр
	|      ПО
	|   Справочник.Ссылка = Регистр.Валюта";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Валюты = РезультатЗапроса.Выбрать();
	
	Пока Валюты.Следующий() Цикл
		СсылкаСправочника =  Валюты.СсылкаСправочника; 
		ОбъектСправочника = СсылкаСправочника.ПолучитьОбъект();
		ОбъектСправочника.АктуальныйКурсПродажи = Валюты.КурсПродажиРегистра;
		ОбъектСправочника.АктуальныйКурсПокупки = Валюты.КурсПокупкиРегистра;
		ОбъектСправочника.ДатаАктуализацииКурса = Валюты.ДатаРегистра;
		ОбъектСправочника.Записать();
	КонецЦикла;
КонецПроцедуры