
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр Остатки Приход и СтоимостьТоваров
	Движения.Остатки.Записывать = Истина;
	Движения.СтоимостьТоваров.Записывать = Истина;
	Движения.ОстаткиТоваровПоПартиям.Записывать =  Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл 
		Если НЕ ТекСтрокаТовары.Товар.ВидТоваров = Перечисления.ВидыТоваров.Услуги Тогда
			
			Движение = Движения.Остатки.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Товар = ТекСтрокаТовары.Товар;
			Движение.Контрагент = Поставщик;
			Движение.Количество = ТекСтрокаТовары.Количество;
			Движение.Цена = ТекСтрокаТовары.Цена;
			Движение.Сумма = ТекСтрокаТовары.Сумма;
			Движение.ДокументОснования = ОснованиеПоставки; 
			
			Движение = Движения.СтоимостьТоваров.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Товар = ТекСтрокаТовары.Товар;
			Движение.Стоимость = ТекСтрокаТовары.Сумма;
			
			Движение = Движения.ОстаткиТоваровПоПартиям.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход; 
			Движение.Период = Дата;
            Движение.Товар = ТекСтрокаТовары.Товар; 
			Движение.Партия = Ссылка;
           	Движение.ОстатокТоваровВПартии = ТекСтрокаТовары.Количество;
			Движение.ОбщаяСтоимостьОстаткаПартии = ТекСтрокаТовары.Сумма;
		КонецЕсли;
		
	КонецЦикла;
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
