
&НаКлиенте
Процедура ДвиженияОстаткиЦенаПриИзменении(Элемент) 
	ИндексСтроки = Элементы.ДвиженияОстатки.ТекущаяСтрока;
	СтрокаТабличнойЧасти = Объект.Движения.Остатки[ИндексСтроки];
	РаботаСДокументами.РассчитатьСумму(СтрокаТабличнойЧасти);
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияОстаткиКоличествоПриИзменении(Элемент)
	ИндексСтроки = Элементы.ДвиженияОстатки.ТекущаяСтрока;
	СтрокаТабличнойЧасти = Объект.Движения.Остатки[ИндексСтроки];
	РаботаСДокументами.РассчитатьСумму(СтрокаТабличнойЧасти);
КонецПроцедуры