
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ПродажиУслуг 
	Движения.ПродажиУслуг.Записывать = Истина;
	Для Каждого ТекСтрокаУслуги Из Услуги Цикл
		Движение = Движения.ПродажиУслуг.Добавить();
		Движение.Период = Дата;
		Движение.Услуги = ТекСтрокаУслуги.Услуга;
		Движение.Клиент = Заказчик;
		Движение.Количество = ТекСтрокаУслуги.Количество;
		Движение.Стоимость = ТекСтрокаУслуги.Цена;
		Движение.Выручка = ТекСтрокаУслуги.Сумма;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
