Функция ВыгрузкаВсехТоваров(Запрос)
	Ответ = Новый HTTPСервисОтвет(200); 
	СтрокаJSON = JSONОбъекты.ПолучитьВсеТоварыJSON();
	Ответ.УстановитьТелоИзСтроки(СтрокаJSON, КодировкаТекста.UTF8); 
	Ответ.Заголовки.Вставить("Content-type", "application/json; charset=utf-8");
	Возврат Ответ;
КонецФункции


Функция ЗагрузкаТоваров(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	СтрокаТоварыJSON = Запрос.ПолучитьТелоКакСтроку();
	JSONОбъекты.ЗагрузитьТоварыJSON(СтрокаТоварыJSON);
	Возврат Ответ;
КонецФункции

