Функция ОтпускнаяЦена(АктуальнаяДата, ЭлементТовары) Экспорт  
	
	// Создать вспомогательный объект "Отбор".
	Отбор = Новый Структура("Товар", ЭлементТовары);  
	
	// Получить актуальные значения ресурсов регистра.
	ЗначенияРесурсов = РегистрыСведений.ОтпускныеЦены.ПолучитьПоследнее(АктуальнаяДата, Отбор);
	
	Возврат ЗначенияРесурсов.Цена;
	
КонецФункции    

Функция ЗакупочнаяЦена(АктуальнаяДата, ЭлементТовары) Экспорт  
	
	// Создать вспомогательный объект "Отбор".
	Отбор = Новый Структура("Товар", ЭлементТовары);  
	
	// Получить актуальные значения ресурсов регистра.
	ЗначенияРесурсов = РегистрыСведений.ЗакупочныеЦены.ПолучитьПоследнее(АктуальнаяДата, Отбор);
	
	Возврат ЗначенияРесурсов.Цена;
	
КонецФункции   

Функция ЦенаУслуги(АктуальнаяДата, ЭлементУслуги) Экспорт  
	
	// Создать вспомогательный объект "Отбор".
	Отбор = Новый Структура("Услуга", ЭлементУслуги);  
	
	// Получить актуальные значения ресурсов регистра.
	ЗначенияРесурсов = РегистрыСведений.ЦеныНаУслуги.ПолучитьПоследнее(АктуальнаяДата, Отбор);
	
	Возврат ЗначенияРесурсов.Цена;
	
КонецФункции