Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;    
	
	Поля.Добавить("Наименование");
	Поля.Добавить("ВидТоваров");
КонецПроцедуры        

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Если ЗначениеЗаполнено(Данные.ВидТоваров) Тогда
		Представление = Данные.Наименование + " (" + НРег(Строка(Данные.ВидТоваров)) + ")";
		
	Иначе
		Представление = Данные.Наименование;
		
	КонецЕсли;
КонецПроцедуры