&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.Услуги.ТекущиеДанные;
	РаботаСДокументами.РассчитатьСумму(СтрокаТабличнойЧасти);
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.Услуги.ТекущиеДанные;
	РаботаСДокументами.РассчитатьСумму(СтрокаТабличнойЧасти);
КонецПроцедуры

&НаКлиенте
Процедура УслугиУслугиПриИзменении(Элемент)
		СтрокаТабличнойЧасти = Элементы.Услуги.ТекущиеДанные;    
		ЕдиницаИзмерения = ПолучитьЕдиницуИзмеренияНаСервере(СтрокаТабличнойЧасти.Услуга);
		СтрокаТабличнойЧасти.ЕдиницыИзмерения = ЕдиницаИзмерения;
	КонецПроцедуры  
	
	&НаСервереБезКонтекста
	Функция ПолучитьЕдиницуИзмеренияНаСервере(СсылкаНаУслугу)
		
		Возврат СсылкаНаУслугу.ЕдиницыИзмерения;
		
	КонецФункции
