
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.КоммерческоеПредложение.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КоммерческоеПредложение.Дата,
	|	КоммерческоеПредложение.Заказчик как Заказчик,
	|	КоммерческоеПредложение.Менеджер КАК Менеджер,    
	|	КоммерческоеПредложение.Менеджер.АдресЭлектроннойПочты КАК МенеджерПочта,
	|	КоммерческоеПредложение.Менеджер.Наименование КАК МенеджерФИО,   
	|	КоммерческоеПредложение.Менеджер.Телефон КАК МенеджерТелефон,
	|	КоммерческоеПредложение.Номер,
	|	КоммерческоеПредложение.Услуги.(
	|		НомерСтроки,
	|		Дата,
	|		Услуга,
	|		Количество,
	|		ЕдиницыИзмерения,
	|		Цена,
	|		Сумма
	|	)
	|ИЗ
	|	Документ.КоммерческоеПредложение КАК КоммерческоеПредложение
	|ГДЕ
	|	КоммерческоеПредложение.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьУслугиШапка = Макет.ПолучитьОбласть("УслугиШапка");
	ОбластьУслуги = Макет.ПолучитьОбласть("Услуги"); 
	ОбластьКонтакты = Макет.ПолучитьОбласть("Контакты");  
	ОбластьИтоги = Макет.ПолучитьОбласть("Итоги");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли; 
		
		ОбластьКонтакты.Параметры.ФИО = Выборка.МенеджерФИО;
		ОбластьКонтакты.Параметры.Почта = Выборка.МенеджерПочта;
		ОбластьКонтакты.Параметры.Телефон =Выборка.МенеджерТелефон;
		
		ТабДок.Вывести(ОбластьКонтакты);  
	
		ОбластьЗаголовок.Параметры.Номер = Выборка.Номер;
		ОбластьЗаголовок.Параметры.Дата2 = Формат(Выборка.Дата, НСтр("ru='ДФ=''дд ММММ гггг ""г.""'''"));	
		
		ТабДок.Вывести(ОбластьЗаголовок);
		
		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьУслугиШапка);
		ВыборкаУслуги = Выборка.Услуги.Выбрать();
		СуммаИтог = 0;
		КоличествоИтог = 0;
		Пока ВыборкаУслуги.Следующий() Цикл
			ОбластьУслуги.Параметры.Заполнить(ВыборкаУслуги);
			ТабДок.Вывести(ОбластьУслуги, ВыборкаУслуги.Уровень());
			СуммаИтог = СуммаИтог + ВыборкаУслуги.Сумма;    
			КоличествоИтог = КоличествоИтог + ВыборкаУслуги.Количество;
			
		КонецЦикла;
        // Область итоги
		ОбластьИтоги.Параметры.ИтоговаяСумма = СуммаИтог;
		ОбластьИтоги.Параметры.Сумма = СуммаИтог;
		ОбластьИтоги.Параметры.Количество = КоличествоИтог;        
		ОбластьИтоги.Параметры.СуммаПрописью = ЧислоПрописью(СуммаИтог, ,"рубль, рубля, рублей, м, копейка, копейки, копеек, ж");
		
		Табдок.Вывести(ОбластьИтоги);
		
		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
КонецПроцедуры
