Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Не ЗначениеЗаполнено(Менеджер) Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Созданная обработка проверки заполнения -- не заполнено поле Менеджер";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли;   
	
	Если Не ЗначениеЗаполнено(Заказчик) Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Созданная обработка проверки заполнения -- не заполнено поле Заказчик";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры