
&НаСервереБезКонтекста
Процедура ВыполнитьОбменНаСервере()
	ВыборкаУзлов = ПланыОбмена.Филиалы.Выбрать();
	Пока ВыборкаУзлов.Следующий() Цикл
		// Произвести обмен данными со всеми узлами, кроме текущего (ЭтотУзел).
		Если ВыборкаУзлов.Ссылка <> ПланыОбмена.Филиалы.ЭтотУзел() Тогда
			УзелОбъект = ВыборкаУзлов.ПолучитьОбъект();
			// Получить сообщение.
			УзелОбъект.ПрочитатьСообщениеСИзменениями();
			// Сформировать сообщение.
			УзелОбъект.ЗаписатьСообщениеСИзменениями();
		КонецЕсли;
	КонецЦикла;КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОбмен(Команда)
	ВыполнитьОбменНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВыполнитьHTTPВыгрузкуТоваровНаСервере()
	
	Сообщение = Новый СообщениеПользователю;
	
	Сервер = "localhost";
	Попытка
		Соединение = Новый HTTPСоединение(Сервер);
		Сообщение.Текст = "Соединение установлено";
		Сообщение.Сообщить();

	Исключение
		Сообщение.Текст = ОписаниеОшибки();
		Сообщение.Сообщить();
		Возврат;
	КонецПопытки;
	
	АдресРесурса = "/MiniSklad/hs/api/product";
	Заголовки = Новый Соответствие;
	
	Логин  = "Администратор";
	Пароль = "";
	Basic = Логин + ":" + Пароль;
	Basic = Base64Строка(ПолучитьДвоичныеДанныеИзСтроки(Basic));
    Заголовки.Вставить("Authorization", "Basic " + Basic);
	
	//ОТВЕЧАЕТ ЗА ТИП ДАННЫХ КОТОРЫЕ БУДУТ УСТАНОВЛЕНЫ В ТЕЛО ЗАПРОСА
	Заголовки.Вставить("Content-Type", "application/json");
	
	HTTPЗапрос = Новый HTTPЗапрос(АдресРесурса, Заголовки);
	
	//Получаем строку JSON с данными по номенклатуре
	СтрокаТоварыJSON = JSONОбъекты.ПолучитьВсеТоварыJSON();
	
	//УСТАНАВЛИВАЕМ ТЕЛО ЗАПРОСА
	HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаТоварыJSON);
	
	Сообщение2 = Новый СообщениеПользователю;
    Попытка
	    //ОТПРАВЛЯЕМ ДАННЫЕ НА СЕРВЕР
		Соединение.ОтправитьДляОбработки(HTTPЗапрос); 
		Сообщение2.Текст = HTTPЗапрос.ПолучитьТелоКакСтроку();
	    Сообщение2.Сообщить();

	
	Исключение
	    Сообщение2.Текст = ОписаниеОшибки();
		Сообщение2.Сообщить();
		Возврат;
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьHTTPВыгрузкуТоваров(Команда)
	ВыполнитьHTTPВыгрузкуТоваровНаСервере();
КонецПроцедуры
